templateFolder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField	uniform (5.2457 0 0);

boundaryField
{
	inlet
	{
		type			freestreamVelocity;
		freestreamValue		$internalField;
	}

	outlet
	{
		type			freestreamVelocity;
		freestreamValue		$internalField;
	}

	airfoil
	{
		type			noSlip;
	}

	frontAndBack
	{
		type			empty;
	}
}

// ************************************************************************* //