templateFolder/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.4163;

boundaryField
{
	inlet
	{
		type			fixedValue;
		value			$internalField;
	}
	outlet
	{
		type			zeroGradient;
	}

	airfoil
	{
		type			omegaWallFunction;
		value			$internalField;
	}
	frontAndBack
	{
		type			empty;
	}
}

// ************************************************************************* //