templateFolder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime		1200;

deltaT		1;

writeControl	timeStep;

writeInterval	1000;

purgeWrite	0;

writeFormat	ascii;

writePrecision	6;

writeCompression off;

timeFormat	general;

timePrecision	6;

runTimeModifiable true;

functions
{

	forcesCoeffs_1
	{
	type	 forceCoeffs;
	functionObjectLibs ("libforces.so");
	patches	(airfoil);
	writeControl  timeStep;
	writeInterval	1;
	//Field names
	p			p;
	U			U;
	log		    yes;
	CofR		(0 0 0);
	liftDir		(0 1 0);
	dragDir		(1 0 0);
	pitchAxis	(0 0 1);
	rho		rhoInf;
	rhoInf		1.225;
	magUInf		5.2457;
	lRef		1;
	Aref		1;
	}
}

// ************************************************************************* //