templateFolder/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default		CrankNicolson 0.9;
}

gradSchemes
{
	default			none;
	grad(U)			Gauss linear;
	grad(nuTilda)	Gauss linear;
	grad(p)			Gauss linear;
	grad(k)			Gauss linear;
	grad(omega)	Gauss linear;
	grad(epsilon)	Gauss linear;
	grad(gammaInt)	Gauss linear;
	grad(ReThetat)	Gauss linear;
}

divSchemes
{
	default			none;
	div(phi,U)		bounded Gauss linearUpwind grad(U);
	div(phi,nuTilda)	bounded Gauss linearUpwind grad(nuTilda);
	div((nuEff*dev2(T(grad(U)))))	Gauss linear;
	div(phi,k)		bounded Gauss limitedLinear 1;
	div(phi,omega)		bounded Gauss limitedLinear 1;
	div(phi,epsilon)	bounded Gauss limitedLinear 1;
	div(phi,v2)		bounded Gauss limitedLinear 1;
	div(phi,gammaInt)	bounded Gauss limitedLinear 1;
	div(phi,ReThetat)	bounded Gauss limitedLinear 1;
}

laplacianSchemes
{
	default		Gauss linear corrected;
}

interpolationSchemes
{
	default		linear;
}

snGradSchemes
{
	default		corrected;
}


wallDist
{
	method meshWave;
}

// ************************************************************************* //